samples/SOAP XML/Iress/TimeSeriesGet2_request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <TimeSeriesGet2 xmlns="http://webservices.iress.com.au/v4/">
      <Input>
        <Header>
          <SessionKey>A630956D-7BD0-477B-B1A2-7441FFC0EDB6-3EAAFF18-00C8-000A-0001-00E6@IDS-TEST</SessionKey>
          <RequestID>0D8A55F4-D507-4598-88F9-0DF144C296DA</RequestID>
          <Updates>false</Updates>
          <Timeout>25</Timeout>
          <PageSize>1000</PageSize>
          <WaitForResponse>true</WaitForResponse>
          <PagingBookmark />
          <PagingDirection>0</PagingDirection>
          <InputLocalizationType>0</InputLocalizationType>
          <OutputLocalizationType>0</OutputLocalizationType>
        </Header>
        <Parameters>
          <SecurityCode>BHP</SecurityCode>
          <Exchange>ASX</Exchange>
          <DataSource xsi:nil="true" />
          <Frequency>Daily</Frequency>
          <TimeSeriesFromDate>2020-10-14</TimeSeriesFromDate>
          <TimeSeriesToDate>2020-10-15</TimeSeriesToDate>
          <SecurityText xsi:nil="true" />
        </Parameters>
      </Input>
    </TimeSeriesGet2>
  </soap:Body>
</soap:Envelope>